# symlink manager
brew "stow"
# Keyboard customiser
cask "karabiner-elements"

# Terminal emulator and multiplexer
cask "wezterm"
# Terminal multiplexer
brew "tmux"
# Manage Tmux sessions
brew "tmuxinator"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line fuzzy finder written in Go
brew "fzf"
# Improved top (interactive process viewer)
brew "htop"
# Theme for zsh
brew "powerlevel10k"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher (required by layzvim)
brew "ripgrep"
# Simple, fast and user-friendly alternative to find (required by layzvim)
brew "fd"
# Simple terminal UI for git commands (works well with layzvim)
brew "lazygit"

# Optional
# Web browser
cask "google-chrome"
# Adaptive brightness for external displays
cask "lunar"
# Clipboard manager
cask "maccy"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Open-source code editor
cask "visual-studio-code"
